Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/legemiddelverket.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: medicinal products2 will get the lowest maximum PPP of medicines within the same ATC code, regardless of whether their marketing authorization is based on biosimilar, well-established use or full dossier applications.
nb: laveste maksimale AIP av legemidler i samme ATC-kode, uavhengig av om søkegrunnlaget for disse legemidlene er biotilsvarende, bibliografisk eller original2.

source: NoMA is prioritising all clinical trial and substantial amendment applications that arise as a result of the covid-19 outbreak.
nb: Vi prioriterer å behandle endringer som følge av covid-19, men grunnet redusert bemanning må det påregnes forlenget saksbehandlingstid på ordinære endringsmeldinger.

source: This applies to approx. 42% of all serious reports
nb: Dette gjelder ca 42 % av totale alvorlige meldinger (dødsfall

source: Are they any covid-19 studies that are currently underway and can be recommended by the NoMA?
nb: Dersom en studie med indikasjon covid-19 blir aktuell for Norge - finnes det noen plan for en raskere saksbehandling av disse søknadene?

source: Large clinical studies have shown around 95% protection against COVID-19 disease, and a high level of protection was found both in the 18-65 age group and in participants over 65 years of age.
nb: Vaksinene viste rundt 95 % beskyttelse mot covid-19-sykdom, og man fant god beskyttelse både i aldersgruppen 18-65 år og hos deltakerne som var over 65 år.

source: If you have any questions about food supplements, please direct your questions to Mattilsynet, the Norwegian Food Safety Authority.
nb: For spørsmål om hva som kan være lovlig kosttilskudd i Norge er det Mattilsynet som skal kontaktes.

source: A temporary halt of the inclusion of new trial participants for ongoing studies due to the covid-19 pandemic can be implemented without sending a notification to NoMA.
nb: Når det gjelder midlertidig stans av inklusjon av nye pasienter i pågående studier på grunn av covid-19 pandemien, kan sponsor implementere dette uten å melde fra til Legemiddelverket.

source: We request that all submissions relating to covid-19 are clearly marked, preferably in the subject heading of your e-mail.
nb: Hva skal jeg gjøre med endringer som skyldes covid-19 på allerede pågående studier i Norge?

source: Postal consignments containing medicinal products from abroad are not allowed and may be stopped by Norwegian Customs.
nb: Postforsendelser med legemidler (både reseptpliktige og reseptfrie) fra utlandet er ikke tillatt og kan bli stoppet i tollkontroll.

source: The list shows that numerous serious suspected adverse effects have been reported following COVID-19 vaccination.
nb: Oversikten viser at det er meldt om flere alvorlige mistenkte bivirkninger etter bruk av covid-19 vaksiner.

source: The remaining four reports have been reviewed and assessed according to the above-mentioned criteria for TTS from the Brighton Collaboration.
nb: De fire resterende meldingene er gjennomgått og vurdert etter de nevnte kriterier for TTS fra Brighton collaboration.

source: posology for products containing aciclovir.
nb: Reklame for legemidler skal være nøktern og saklig.

source: Since the efficacy was relatively similar across all age groups covered by the studies, it is still believed that the protection in elderly over 85 years of age will be similar to that of people over 65 years of age (extrapolation).
nb: Siden effekten var nokså lik i alle aldersgruppene som var med i studiene, forutsetter man likevel at beskyttelsen hos eldre over 85 år vil være omtrent som for personer over 65 år (ekstrapolering).

source: The prices of newly-launched products are exempt from this rule.
nb: Unntatt fra dette er prisen på nye produkter etter lansering.

source: Type IA and Type IB variations without changes to the SmPC, Patient Information Leaflet and labeling will not be charged
nb: Det tas ikke gebyr for type IA endringer og endringer type IB uten endringer i preparatomtale, pakningsvedlegg og merking.

source: Al medicinal products for human use containing an active substance stated in the warning triangle
nb: • Etablere vilkår for bruk av nye legemidler før MT • Fremgangsmåte for lokal godkjenning av bruk av nye

source: The appendix should be submitted as a consolidated amendment along with any other possible changes, e.g. to the protocol, EudraCT form, etc. when the pandemic situation is stable and there is a lowered probability for the need for further covid-19-related changes in the immediate future, or when the sponsor wishes to do so.
nb: når pandemi-situasjonen er stabil, og det er mindre sannsynlig at det blir behov for flere Covid-19-realerte endringer den nærmeste tiden, eller tidligere hvis det er ønskelig for sponsor.

source: NoMA would also like to encourage all clinical trial investigators and their teams to carefully consider whether it is appropriate to burden the Health Service with the commencement and implementation of new clinical trials that are not related to covid-19 during this current period of an ongoing pandemic.
nb: Vi oppfordrer også til å overveie grundig om det er riktig å belaste helsetjenesten med oppstart av nye studier som ikke er relatert til covid-19 i denne perioden med pågående pandemi.

source: NoMA considers this to be necessary change for ongoing clinical trials, given the current measures implemented by the government
nb: Legemiddelverket anser dette som en nødvendig endring i pågående kliniske studier, gitt de tiltakene som nå gjennomføres.

source: However, the studies that formed the basis for the Conditional Marketing Authorisation included very few people over the age of 85.
nb: Men studiene som ligger til grunn for den midlertidige godkjenningen av vaksinene inkluderte svært få personer over 85 år.

source: Such statistical analyses of reported adverse reactions have shown that serious allergic reactions occur more frequently following COVID-19 vaccination than with vaccination with influenza vaccines.
nb: Slike statistiske analyser av meldte bivirkninger har vist at alvorlige allergiske reaksjoner opptrer hyppigere ved covid-19 vaksiner enn ved influensavaksine.
